import React from 'react'
import "./Pages.css"
import ExpandableText from '../CommonComponents/ExpandbleText'
const QuestionAnswer = () => {
  return (
    <div>
    <h1 className='title'>Часто задаваемые вопросы</h1>
    <ExpandableText title={"Какие данные можно анализировать с помощью вашего приложения?"}
    bodyText={"Наше приложение позволяет анализировать разнообразные сигналы с ЧПУ станков, включая данные о скорости движения, температуре, и точности позиционирования."}
    />
    <ExpandableText title={"Какие возможности предоставляет ваше приложение для визуализации данных?"}
    bodyText={"Мы предлагаем широкий выбор графиков и диаграмм для визуализации анализируемых сигналов, включая линейные графики, круговые диаграммы, и гистограммы для более наглядного отображения данных."}
    />
    <ExpandableText title={"Какие типы сигналов поддерживаются для анализа?"}
    bodyText={"Наше приложение позволяет анализировать разнообразные сигналы с ЧПУ станков, включая данные о скорости движения, температуре, и точности позиционирования."}
    />
    <ExpandableText title={"Могу ли я экспортировать данные из приложения?"}
    bodyText={"Наше приложение позволяет анализировать разнообразные сигналы с ЧПУ станков, включая данные о скорости движения, температуре, и точности позиционирования."}
    />
    <ExpandableText title={"Какой формат графиков поддерживается в приложении?"}
    bodyText={"Наше приложение позволяет анализировать разнообразные сигналы с ЧПУ станков, включая данные о скорости движения, температуре, и точности позиционирования."}
    />
    <ExpandableText title={"Как часто приложение обновляется и добавляются новые функции?"}
    bodyText={"Наше приложение позволяет анализировать разнообразные сигналы с ЧПУ станков, включая данные о скорости движения, температуре, и точности позиционирования."}
    />
    <ExpandableText title={"Какие устройства совместимы с вашим приложением?"}
    bodyText={"Наше приложение позволяет анализировать разнообразные сигналы с ЧПУ станков, включая данные о скорости движения, температуре, и точности позиционирования."}
    />
    <ExpandableText title={"Как обеспечивается безопасность данных в приложении?"}
    bodyText={"Наше приложение позволяет анализировать разнообразные сигналы с ЧПУ станков, включая данные о скорости движения, температуре, и точности позиционирования."}
    />
    <ExpandableText title={"Есть ли возможность просмотра истории анализа сигналов?"}
    bodyText={"Наше приложение позволяет анализировать разнообразные сигналы с ЧПУ станков, включая данные о скорости движения, температуре, и точности позиционирования."}
    />
    <ExpandableText title={"Какие виды отчетов можно создавать с помощью приложения?"}
    bodyText={"Наше приложение позволяет анализировать разнообразные сигналы с ЧПУ станков, включая данные о скорости движения, температуре, и точности позиционирования."}
    />
    </div>
  )
}

export default QuestionAnswer